{
  "terms": "Terms of Service\n\nLast updated: February 2026\n\n1. Acceptance of Terms\nThese terms govern your use of Miriel (the \"Service\"). By using the Service, you agree to be bound by these terms.\n\n2. Service Description\nMiriel is an AI-powered reflection journal that automatically organizes your entries and generates summaries.\n\n3. Accounts\nYou must provide accurate information when creating an account. You are responsible for maintaining the security of your account.\n\n4. Acceptable Use\nYou may not use the Service for any illegal or unauthorized purpose. You must not violate the rights of other users.\n\n5. Intellectual Property\nYou retain ownership of content you create. A limited license is granted to us solely for operating the Service.\n\n6. AI Features\nAI-generated summaries and suggestions are provided for reference only and are not guaranteed to be accurate. Important decisions should rely on your own judgment.\n\n7. Service Changes\nThe Service may be modified or discontinued with prior notice.\n\n8. Limitation of Liability\nThe Service is provided \"as is.\" We are not liable for any indirect damages arising from use of the Service.\n\n9. Changes to Terms\nThese terms may be updated. Significant changes will be communicated through in-app notifications.",
  "privacy": "Privacy Policy\n\nLast updated: February 2026\n\n1. Information We Collect\nWe collect information you provide directly, such as email address, username, nickname, and profile details, as well as service usage records.\n\n2. How We Use Information\nCollected information is used to provide the Service, generate AI-based summaries, and improve user experience.\n\n3. AI Data Processing\nYour entries are sent to OpenAI for AI features including summary generation, todo extraction, and conversational check-ins. OpenAI does not use API data for model training. We do not use your data to train any AI models.\n\n4. Data Storage\nData is stored on Cloudflare (D1 database and R2 storage) with industry-standard encryption and access controls.\n\n5. Data Sharing\nWe do not share personal information with third parties without your explicit consent, except as described in this policy (OpenAI for AI processing, Cloudflare for hosting, Resend for transactional emails) or when required by law.\n\n6. Your Rights\nYou may request access to, correction of, or deletion of your data at any time. You can export all your data or delete your account from the Settings screen.\n\n7. Communications\nWe send transactional emails for account verification, password reset, and service notifications. We may send promotional or informational emails in the future; you will always be able to opt out.\n\n8. Cookies and Analytics\nWe may use cookies and collect anonymized usage statistics to improve the Service. If we do, we will update this policy accordingly.\n\n9. Security\nWe apply industry-standard security measures including encrypted storage, secure authentication, and regular access reviews to protect your data.\n\n10. Contact\nFor privacy-related inquiries, please contact support@miriel.app."
}
